//! What is Loop?
// একই কাজ বারবার করাকে লুপ বলে।

//! WHat maney loop in javascript?
// জাভাস্ক্রিপ্টে প্রধানত ৩ ধরণের লুপ বেশি ব্যবহৃত হয় |

// 1. For Loop (সবচেয়ে বেশি ব্যবহৃত হয়)
// 2. While Loop (শর্তের ওপর চলে)
// 3. Do-While Loop (অন্তত একবার কাজ করবেই)
// 4. For of Loop (অ্যরের ক্ষেত্তে ব্যবহার হই)

//! What is the for loop tructure?
//  for ( initialization ; condition ; increment ) {
//     // লুপের বডি (যে কাজটা বারবার হবে)
//  }

// ১ থেকে ৫ পর্যন্ত প্রিন্ট করার লুপ
// for (var i = 1; i <= 5; i++) {
//     console.log("I Love JavaScript:", i);
// }

//! What is for loop?
// যখন তুমি আগে থেকেই জানো যে তোমাকে কাজটা ঠিক কতবার করতে হবে, তখন For Loop ব্যবহার করা হয়।
// উদাহরণ: ১ থেকে ১০ পর্যন্ত সংখ্যা প্রিন্ট করো। (এখানে তুমি জানো ১০ বার ঘুরতে হবে)।

// ১ থেকে ৫ পর্যন্ত প্রিন্ট করার লুপ

// for (let i = 1; i <= 5; i++) {
//     console.log("I Love JavaScript:", i)
// }

//! What is while Loop?
// যখন আমরা জানি না কতবার লুপটা ঘুরবে, কিন্তু একটা শর্ত (Condition) জানি, তখন While Loop ব্যবহার করি।

// var i = 1; // লুপ ভেরিয়েবল আগে ডিক্লেয়ার করতে হয়
// while (i <= 5) { // শুধু শর্তটা এখানে থাকে
//     console.log(i);
//     i++; // মান পরিবর্তন লুপের ভেতরে করতে হয়
// }

//! What is Do while loop?
// এটা একটু ঘাড়তেড়া টাইপের লুপ। 😅 অন্য লুপ আগে শর্ত চেক করে, তারপর কাজ করে। কিন্তু Do-While Loop আগে একবার কাজ করে, তারপর শর্ত চেক করে।

// মানে: শর্ত মিথ্যা হলেও এই লুপ অন্তত একবার (At least one time) আউটপুট দেবেই।

// উদাহরণ:

// var i = 10;

// do {
//     console.log(i); // আগে প্রিন্ট করবে
//     i++; 
// } while (i < 5); // তারপর চেক করবে (১০ কি ৫ এর ছোট? না। লুপ বন্ধ।)

//! What is for loop ?
// এটা নতুন এবং খুব সহজ। যখন তোমার কোনো লিস্ট বা অ্যারে (Array) থাকে এবং তুমি সেটার সব উপাদানের ওপর লুপ চালাতে চাও। এখানে i++ বা শর্ত কিছুই লাগে না।

// কোড:

// JavaScript

// let fruits = ["Mango", "Banana", "Apple"];

// for (let fruit of fruits) {
//     console.log(fruit); // একাই সব ফল প্রিন্ট করে দেবে
// }
// এটা অনেকটা বাংলা কথার মতো: "ফলের ঝুড়ি থেকে একটা একটা করে ফল নাও"। 