//? জাভাস্ক্রিপ্টে আট ধরনের মৌলিক ডেটা টাইপ বা ডেটার প্রকার রয়েছে। এগুলোকে প্রধানত দুটি ভাগে ভাগ করা হয়: 
// ----------------------------------------------------------------------------------------------=>
// 1) Primitive (মৌলিক) এবং 
// 2) Non-Primitive (অ-মৌলিক)। 

//? JavaScript Primitive Data Types (মোট ৭টি)
// ---------------------------------------------=>

// ১. String (স্ট্রিং): যেকোনো টেক্সট বা লেখা। উদাহরণ: "Bangladesh", "Hello" 
// ২. Number (নাম্বার): যেকোনো সংখ্যা (পূর্ণসংখ্যা বা দশমিক)। উদাহরণ: 555, 10.5
// ৩. Boolean (বুলিয়ান): শুধুমাত্র সত্য বা মিথ্যা বোঝাতে। উদাহরণ: true, false
// ৪. Undefined (আনডিফাইন্ড): ভেরিয়েবল ডিক্লেয়ার করা হয়েছে, কিন্তু কোনো মান দেওয়া হয়নি 
//                           উদাহরণ: let a; (এখন a এর মান undefined)
// ৫. Null (নাল): ইচ্ছাকৃতভাবে কোনো ভ্যালু না রাখা বা 'খালি' রাখা। উদাহরণ: let a = null;
// ৬. BigInt (বিগ ইন্ট): Number এর ক্ষমতার বাইরের অনেক বড় পূর্ণসংখ্যা। উদাহরণ: অনেক বড় সংখ্যার শেষে n থাকে।
// ৭. Symbol (সিম্বল): এমন একটি মান যা সবসময় ইউনিক (Unique) বা অদ্বিতীয় হয়।
//                  ব্যবহার: সাধারণত অবজেক্টের কী (Key) হিসেবে লাগে।


//?  Non-Primitive Data Types (নন-প্রিমিটিভ)
//? এগুলো মূলত Object (অবজেক্ট) এবং এগুলো পরিবর্তনশীল (Mutable)। অর্থাৎ, এদের ভেতরের তথ্য পরে পরিবর্তন করা যায়।
// -----------------------------------------------------------------------------------------------=>

// ১. Object (অবজেক্ট): অনেকগুলো ডেটা বা তথ্যের সমষ্টি (Collection)। 
//                     কাজ: এতে প্রোপার্টি (বৈশিষ্ট্য) এবং মেথড থাকে। 
//                     উদাহরণ: মানুষের নাম, বয়স, উচ্চতা একসাথে রাখা। { name: "Ratul", age: 25 }

// ২. Array (অ্যারে):  তথ্যের তালিকা (List)। এটি আসলে এক ধরণের বিশেষ অবজেক্ট। 
//                   কাজ: একাধিক মানকে ক্রম বা ইনডেক্স (0, 1, 2) অনুসারে সাজিয়ে রাখে।
//                   উদাহরণ: ফলের তালিকা ["Apple", "Mango", "Banana"]

// ৩. Function (ফাংশন): একটি কোড ব্লক যা নির্দিষ্ট কোনো কাজ করে। 
//                      কাজ: এটিও এক ধরণের অবজেক্ট যা কল (Call) করা যায়।
//                      উদাহরণ: যোগ করার ফাংশন বা প্রিন্ট করার ফাংশন।


//! IsNaN:
// isNaN মানেই হলো "ভেজাল ডিটেক্টর"।
// ভেজাল (Text/Garbage) পেলে True।
// আসল মাল (Number) পেলে False।